apache/nuttx/arch/arm/src/imxrt/imxrt_ehci.c
#ifdef HAVE_USBHOST_TRACE_VERBOSE
  EHCI_VTRACE1_PORTSC_CSC,          /* EHCI Connect Status Change */
  EHCI_VTRACE1_PORTSC_CONNALREADY,  /* EHCI Already connected */
  EHCI_VTRACE1_PORTSC_DISCALREADY,  /* EHCI Already disconnected */
  EHCI_VTRACE1_TOPHALF,             /* EHCI Interrupt top half */
  EHCI_VTRACE1_AAINTR,              /* EHCI Async Advance Interrupt */

  EHCI_VTRACE1_CLASSENUM,           /* EHCI Hub port CLASS enumeration */
  EHCI_VTRACE1_USBINTR,             /* EHCI USB Interrupt (USBINT) Interrupt */
  EHCI_VTRACE1_ENUM_DISCONN,        /* EHCI Enumeration not connected */
  EHCI_VTRACE1_INITIALIZING,        /* EHCI Initializing EHCI Stack */
  EHCI_VTRACE1_HCCPARAMS,           /* EHCI HCCPARAMS */
  EHCI_VTRACE1_INIITIALIZED,        /* EHCI USB EHCI Initialized */
#endif

  __TRACE1_NSTRINGS,                /* Separates the format 1 from the format 2 strings */

  EHCI_TRACE2_EPSTALLED,            /* EHCI EP Stalled */
  EHCI_TRACE2_EPIOERROR,            /* EHCI ERROR: EP TOKEN */
  EHCI_TRACE2_CLASSENUM_FAILED,     /* EHCI usbhost_enumerate() failed */

#ifdef HAVE_USBHOST_TRACE_VERBOSE
  EHCI_VTRACE2_ASYNCXFR,            /* EHCI Async transfer */
  EHCI_VTRACE2_INTRXFR,             /* EHCI Interrupt Transfer */
  EHCI_VTRACE2_IOCCHECK,            /* EHCI IOC */
  EHCI_VTRACE2_PORTSC,              /* EHCI PORTSC */
  EHCI_VTRACE2_PORTSC_CONNECTED,    /* EHCI RHPort connected */
  EHCI_VTRACE2_PORTSC_DISCONND,     /* EHCI RHport disconnected */
  EHCI_VTRACE2_MONWAKEUP,           /* EHCI RHPort connected wakeup */

  EHCI_VTRACE2_EPALLOC,             /* EHCI EPALLOC */
  EHCI_VTRACE2_CTRLINOUT,           /* EHCI CTRLIN/OUT */
  EHCI_VTRACE2_HCIVERSION,          /* EHCI HCIVERSION */
  EHCI_VTRACE2_HCSPARAMS,           /* EHCI HCSPARAMS */
#endif

  __TRACE2_NSTRINGS                 /* Total number of enumeration values */
};

/* USB trace data structure */

struct imxrt_ehci_trace_s
{
#if 0
  uint16_t id;
  bool fmt2;
#endif
  const char *string;
};

#endif /* HAVE_USBHOST_TRACE */

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations ******************************************************/

static uint16_t imxrt_read16(const uint8_t *addr);
static uint32_t imxrt_read32(const uint8_t *addr);
#if 0 /* Not used */
static void imxrt_write16(uint16_t memval, uint8_t *addr);
static void imxrt_write32(uint32_t memval, uint8_t *addr);
#endif

#ifdef CONFIG_ENDIAN_BIG
static uint16_t imxrt_swap16(uint16_t value);
static uint32_t imxrt_swap32(uint32_t value);
#else
#  define imxrt_swap16(value) (value)
#  define imxrt_swap32(value) (value)
#endif

#ifdef CONFIG_IMXRT_EHCI_USB1_REGDEBUG
static void imxrt_printreg(volatile uint32_t *regaddr, uint32_t regval,
         bool iswrite);
static void imxrt_checkreg(volatile uint32_t *regaddr, uint32_t regval,
         bool iswrite);
static uint32_t imxrt_getreg(volatile uint32_t *regaddr);
static void imxrt_putreg(uint32_t regval, volatile uint32_t *regaddr);
#else
static inline uint32_t imxrt_getreg(volatile uint32_t *regaddr);
static inline void imxrt_putreg(uint32_t regval, volatile uint32_t *regaddr);
#endif
static int ehci_wait_usbsts(int controller, uint32_t maskbits,
         uint32_t donebits,
         unsigned int delay);

/* Allocators ***************************************************************/

static struct imxrt_qh_s *imxrt_qh_alloc(struct imxrt_ehci_dev_s *ehci_dev);
static void imxrt_qh_free(struct imxrt_qh_s *qh,
                          struct imxrt_ehci_dev_s *ehci_dev);
static struct imxrt_qtd_s *imxrt_qtd_alloc(struct imxrt_ehci_dev_s
                                           *ehci_dev);
static void imxrt_qtd_free(struct imxrt_qtd_s *qtd,
                           struct imxrt_ehci_dev_s *ehci_dev);

/* List Management **********************************************************/

static int imxrt_qh_foreach(struct imxrt_qh_s *qh, uint32_t **bp,
         foreach_qh_t handler, void *arg, struct imxrt_ehci_dev_s *ehci_dev);
static int imxrt_qtd_foreach(struct imxrt_qh_s *qh,
         foreach_qtd_t handler, void *arg,
         struct imxrt_ehci_dev_s *ehci_dev);
static int imxrt_qtd_discard(struct imxrt_qtd_s *qtd,
         uint32_t **bp, void *arg, struct imxrt_ehci_dev_s *ehci_dev);
static int imxrt_qh_discard(struct imxrt_qh_s *qh,
                            struct imxrt_ehci_dev_s *ehci_dev);

/* Cache Operations *********************************************************/

#if 0 /* Not used */
static int imxrt_qtd_invalidate(struct imxrt_qtd_s *qtd, uint32_t **bp,
          void *arg);
static int imxrt_qh_invalidate(struct imxrt_qh_s *qh);
#endif
static int imxrt_qtd_flush(struct imxrt_qtd_s *qtd, uint32_t **bp,
                           void *arg, struct imxrt_ehci_dev_s *ehci_dev);
static int imxrt_qh_flush(struct imxrt_qh_s *qh,
                          struct imxrt_ehci_dev_s *ehci_dev);

/* Endpoint Transfer Handling ***********************************************/

#ifdef CONFIG_IMXRT_EHCI_USB1_REGDEBUG
static void imxrt_qtd_print(struct imxrt_qtd_s *qtd);
static void imxrt_qh_print(struct imxrt_qh_s *qh);
static int imxrt_qtd_dump(struct imxrt_qtd_s *qtd, uint32_t **bp, void *arg,
                          struct imxrt_ehci_dev_s *ehci_dev);
static int imxrt_qh_dump(struct imxrt_qh_s *qh, uint32_t **bp, void *arg,
                         struct imxrt_ehci_dev_s *ehci_dev);
#else
#  define imxrt_qtd_print(qtd)
#  define imxrt_qh_print(qh)
#  define imxrt_qtd_dump(qtd, bp, arg, ehci_dev) ((void)OK)
#  define imxrt_qh_dump(qh, bp, arg, ehci_dev)   ((void)OK)
#endif

static inline uint8_t imxrt_ehci_speed(uint8_t usbspeed);
static int imxrt_ioc_setup(struct imxrt_rhport_s *rhport,
         struct imxrt_epinfo_s *epinfo);
static int imxrt_ioc_wait(struct imxrt_epinfo_s *epinfo);
static void imxrt_qh_enqueue(struct imxrt_qh_s *qhead,
         struct imxrt_qh_s *qh, struct imxrt_ehci_dev_s *ehci_dev);
static struct imxrt_qh_s *imxrt_qh_create(struct imxrt_rhport_s *rhport,
         struct imxrt_epinfo_s *epinfo, struct imxrt_ehci_dev_s *ehci_dev);
static int imxrt_qtd_addbpl(struct imxrt_qtd_s *qtd, const void *buffer,
         size_t buflen, struct imxrt_ehci_dev_s *ehci_dev);
static struct imxrt_qtd_s *imxrt_qtd_setupphase(
         struct imxrt_epinfo_s *epinfo, const struct usb_ctrlreq_s *req,
         struct imxrt_ehci_dev_s *ehci_dev);
static struct imxrt_qtd_s *imxrt_qtd_dataphase(struct imxrt_epinfo_s *epinfo,
         void *buffer, int buflen, uint32_t tokenbits,
         struct imxrt_ehci_dev_s *ehci_dev);
static struct imxrt_qtd_s *imxrt_qtd_statusphase(uint32_t tokenbits,
         struct imxrt_ehci_dev_s *ehci_dev);
#ifndef CONFIG_USBHOST_INT_DISABLE
static int imxrt_intr_setup(struct imxrt_rhport_s *rhport,
         struct imxrt_epinfo_s *epinfo, uint8_t *buffer, size_t buflen);
#endif
static ssize_t imxrt_transfer_wait(struct imxrt_rhport_s *rhport,
                                   struct imxrt_epinfo_s *epinfo);
#ifdef CONFIG_USBHOST_ASYNCH
static inline int imxrt_ioc_async_setup(struct imxrt_rhport_s *rhport,
         struct imxrt_epinfo_s *epinfo, usbhost_asynch_t callback,
         void *arg);
static void imxrt_asynch_completion(struct imxrt_epinfo_s *epinfo);
#endif

/* Interrupt Handling *******************************************************/

static int imxrt_qtd_ioccheck(struct imxrt_qtd_s *qtd, uint32_t **bp,
         void *arg, struct imxrt_ehci_dev_s *ehci_dev);
static int imxrt_qh_ioccheck(struct imxrt_qh_s *qh, uint32_t **bp,
         void *arg, struct imxrt_ehci_dev_s *ehci_dev);
#ifdef CONFIG_USBHOST_ASYNCH
static int imxrt_qtd_cancel(struct imxrt_qtd_s *qtd, uint32_t **bp,
         void *arg, struct imxrt_ehci_dev_s *ehci_dev);
static int imxrt_qh_cancel(struct imxrt_qh_s *qh, uint32_t **bp, void *arg,
         struct imxrt_ehci_dev_s *ehci_dev);
#endif
static inline void imxrt_ioc_bottomhalf(struct imxrt_ehci_dev_s *ehci_dev);
static inline void imxrt_portsc_bottomhalf(struct imxrt_ehci_dev_s
                                           *ehci_dev);
static inline void imxrt_syserr_bottomhalf(void);
static inline void imxrt_async_advance_bottomhalf(void);
static void imxrt_ehci_bottomhalf(void *arg);
static int imxrt_ehci_interrupt(int irq, void *context, void *arg);

/* USB Host Controller Operations *******************************************/

static int imxrt_wait(struct usbhost_connection_s *conn,
                      struct usbhost_hubport_s **hport);
static int imxrt_rh_enumerate(struct usbhost_connection_s *conn,
                              struct usbhost_hubport_s *hport);
static int imxrt_enumerate(struct usbhost_connection_s *conn,
                           struct usbhost_hubport_s *hport);

static int imxrt_ep0configure(struct usbhost_driver_s *drvr,
                              usbhost_ep_t ep0, uint8_t funcaddr,
                              uint8_t speed, uint16_t maxpacketsize);
static int imxrt_epalloc(struct usbhost_driver_s *drvr,
                         const struct usbhost_epdesc_s *epdesc,
                         usbhost_ep_t *ep);
static int imxrt_epfree(struct usbhost_driver_s *drvr, usbhost_ep_t ep);
static int imxrt_alloc(struct usbhost_driver_s *drvr,
                       uint8_t **buffer, size_t *maxlen);
static int imxrt_free(struct usbhost_driver_s *drvr,
                      uint8_t *buffer);
static int imxrt_ioalloc(struct usbhost_driver_s *drvr,
                         uint8_t **buffer, size_t buflen);
static int imxrt_iofree(struct usbhost_driver_s *drvr,
                        uint8_t *buffer);
static int imxrt_ctrlin(struct usbhost_driver_s *drvr, usbhost_ep_t ep0,
                        const struct usb_ctrlreq_s *req,
                        uint8_t *buffer);
static int imxrt_ctrlout(struct usbhost_driver_s *drvr, usbhost_ep_t ep0,
                         const struct usb_ctrlreq_s *req,
                         const uint8_t *buffer);
static ssize_t imxrt_transfer(struct usbhost_driver_s *drvr,
                              usbhost_ep_t ep, uint8_t *buffer,
                              size_t buflen);
#ifdef CONFIG_USBHOST_ASYNCH
static int imxrt_asynch(struct usbhost_driver_s *drvr, usbhost_ep_t ep,
                        uint8_t *buffer, size_t buflen,
                        usbhost_asynch_t callback, void *arg);
#endif
static int imxrt_cancel(struct usbhost_driver_s *drvr, usbhost_ep_t ep);
#ifdef CONFIG_USBHOST_HUB
static int imxrt_connect(struct usbhost_driver_s *drvr,
                         struct usbhost_hubport_s *hport,
                         bool connected);
#endif
static void imxrt_disconnect(struct usbhost_driver_s *drvr,
                             struct usbhost_hubport_s *hport);

/* Initialization ***********************************************************/

