apache/nuttx/arch/arm/src/imxrt/imxrt_ehci.c
static int imxrt_reset(int ctrid);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* In this driver implementation, support is provided for only a single a
 * single USB device.  All status information can be simply retained in a
 * single global instance.
 */

static struct imxrt_ehci_s g_ehci_usb1 =
{
  .lock = NXMUTEX_INITIALIZER,
  .pscsem = SEM_INITIALIZER(0),
  .ep0.iocsem = SEM_INITIALIZER(1),
};

#if defined(CONFIG_IMXRT_USBOTG2)
static struct imxrt_ehci_s g_ehci_usb2 =
{
  .lock = NXMUTEX_INITIALIZER,
  .pscsem = SEM_INITIALIZER(0),
  .ep0.iocsem = SEM_INITIALIZER(1),
};
#endif

/* Maps USB chapter 9 speed to EHCI speed */

static const uint8_t g_ehci_speed[4] =
{
  0, EHCI_LOW_SPEED, EHCI_FULL_SPEED, EHCI_HIGH_SPEED
};

/* The head of the asynchronous queue */

static struct imxrt_qh_s g_asynchead_usb1 aligned_data(32);

#if defined(CONFIG_IMXRT_USBOTG2)
static struct imxrt_qh_s g_asynchead_usb2 aligned_data(32);
#endif

#ifndef CONFIG_USBHOST_INT_DISABLE
/* The head of the periodic queue */

static struct imxrt_qh_s g_intrhead_usb1   aligned_data(32);

#if defined(CONFIG_IMXRT_USBOTG2)
static struct imxrt_qh_s g_intrhead_usb2   aligned_data(32);
#endif

/* The frame list */

#ifdef CONFIG_IMXRT_EHCI_USB1_PREALLOCATE
static uint32_t g_framelist_usb1[FRAME_LIST_SIZE] aligned_data(4096);
#else
static uint32_t *g_framelist_usb1;
#endif

#if defined(CONFIG_IMXRT_USBOTG2)
#ifdef CONFIG_IMXRT_EHCI_USB2_PREALLOCATE
static uint32_t g_framelist_usb2[FRAME_LIST_SIZE] aligned_data(4096);
#else
static uint32_t *g_framelist_usb2;
#endif
#endif /* CONFIG_IMXRT_USBOTG2 */

#endif /* CONFIG_USBHOST_INT_DISABLE */

#ifdef CONFIG_IMXRT_USBOTG1
#  ifdef CONFIG_IMXRT_EHCI_USB1_PREALLOCATE
/* Pools of pre-allocated data structures.  These will all be linked into the
 * free lists within g_ehci.  These must all be aligned to 32-byte boundaries
 */

/* Queue Head (QH) pool */

static struct imxrt_qh_s g_qhpool_usb1[CONFIG_IMXRT_EHCI_USB1_NQHS]
                       aligned_data(32);

/* Queue Element Transfer Descriptor (qTD) pool */

static struct imxrt_qtd_s g_qtdpool_usb1[CONFIG_IMXRT_EHCI_USB1_NQTDS]
                        aligned_data(32);

#  else
/* Pools of dynamically data structures.  These will all be linked into the
 * free lists within g_ehci.  These must all be aligned to 32-byte boundaries
 */

/* Queue Head (QH) pool */

static struct imxrt_qh_s *g_qhpool_usb1;

/* Queue Element Transfer Descriptor (qTD) pool */

static struct imxrt_qtd_s *g_qtdpool_usb1;

#  endif
#endif /* CONFIG_IMXRT_USBOTG1 */

#ifdef CONFIG_IMXRT_USBOTG2
#  ifdef CONFIG_IMXRT_EHCI_USB2_PREALLOCATE
/* Pools of pre-allocated data structures.  These will all be linked into the
 * free lists within g_ehci.  These must all be aligned to 32-byte boundaries
 */

/* Queue Head (QH) pool */

static struct imxrt_qh_s g_qhpool_usb2[CONFIG_IMXRT_EHCI_USB2_NQHS]
                       aligned_data(32);

/* Queue Element Transfer Descriptor (qTD) pool */

static struct imxrt_qtd_s g_qtdpool_usb2[CONFIG_IMXRT_EHCI_USB2_NQTDS]
                        aligned_data(32);

#  else
/* Pools of dynamically data structures.  These will all be linked into the
 * free lists within g_ehci.  These must all be aligned to 32-byte boundaries
 */

/* Queue Head (QH) pool */

static struct imxrt_qh_s *g_qhpool_usb2;

/* Queue Element Transfer Descriptor (qTD) pool */

static struct imxrt_qtd_s *g_qtdpool_usb2;

#  endif
#endif /* CONFIG_IMXRT_USBOTG2 */

/* EHCI Device instance to be passed to share as private between functions */

#if defined(CONFIG_IMXRT_USBOTG1)
static struct imxrt_ehci_dev_s g_ehci_dev_usb1 =
{
  .ehci      = &g_ehci_usb1,
  .asynchead = &g_asynchead_usb1,
  .qhpool    = &g_qhpool_usb1[0],
  .qtdpool   = &g_qtdpool_usb1[0],
  .framelist = &g_framelist_usb1[0],
  .intrhead  = &g_intrhead_usb1,
  .pending   = 0,
};
#endif

#if defined(CONFIG_IMXRT_USBOTG2)
static struct imxrt_ehci_dev_s g_ehci_dev_usb2 =
{
  .ehci      = &g_ehci_usb2,
  .asynchead = &g_asynchead_usb2,
  .qhpool    = &g_qhpool_usb2[0],
  .qtdpool   = &g_qtdpool_usb2[0],
  .framelist = &g_framelist_usb2[0],
  .intrhead  = &g_intrhead_usb2,
  .pending   = 0,
};
#endif

/* This is the connection/enumeration interface */

#if defined(CONFIG_IMXRT_USBOTG1)
static struct imxrt_usbhost_conn_s g_ehci_usb1_conn =
{
  .ehci_conn =
  {
    .wait = imxrt_wait,
    .enumerate = imxrt_enumerate,
  },
  .ehci_dev = &g_ehci_dev_usb1,
};
#endif

#if defined(CONFIG_IMXRT_USBOTG2)
static struct imxrt_usbhost_conn_s g_ehci_usb2_conn =
{
  .ehci_conn =
  {
    .wait = imxrt_wait,
    .enumerate = imxrt_enumerate,
  },
  .ehci_dev = &g_ehci_dev_usb2,
};
#endif

#ifdef HAVE_USBHOST_TRACE
/* USB trace strings */

static const struct imxrt_ehci_trace_s g_trace1[TRACE1_NSTRINGS] =
{
  TRENTRY(EHCI_TRACE1_SYSTEMERROR, TR_FMT1,
          "EHCI ERROR: System error: %06x\n"),
  TRENTRY(EHCI_TRACE1_QTDFOREACH_FAILED, TR_FMT1,
          "EHCI ERROR: imxrt_qtd_foreach failed: %d\n"),
  TRENTRY(EHCI_TRACE1_QHALLOC_FAILED, TR_FMT1,
          "EHCI ERROR: Failed to allocate a QH\n"),
  TRENTRY(EHCI_TRACE1_BUFTOOBIG, TR_FMT1,
          "EHCI ERROR: Buffer too big. Remaining %d\n"),
  TRENTRY(EHCI_TRACE1_REQQTDALLOC_FAILED, TR_FMT1,
          "EHCI ERROR: Failed to allocate request qTD"),
  TRENTRY(EHCI_TRACE1_ADDBPL_FAILED, TR_FMT1,
          "EHCI ERROR: imxrt_qtd_addbpl failed: %d\n"),
  TRENTRY(EHCI_TRACE1_DATAQTDALLOC_FAILED, TR_FMT1,
          "EHCI ERROR: Failed to allocate data buffer qTD, 0"),
  TRENTRY(EHCI_TRACE1_DEVDISCONNECTED, TR_FMT1,
          "EHCI ERROR: Device disconnected %d\n"),
  TRENTRY(EHCI_TRACE1_QHCREATE_FAILED, TR_FMT1,
          "EHCI ERROR: imxrt_qh_create failed\n"),
  TRENTRY(EHCI_TRACE1_QTDSETUP_FAILED, TR_FMT1,
          "EHCI ERROR: imxrt_qtd_setupphase failed\n"),

  TRENTRY(EHCI_TRACE1_QTDDATA_FAILED, TR_FMT1,
          "EHCI ERROR: imxrt_qtd_dataphase failed\n"),
  TRENTRY(EHCI_TRACE1_QTDSTATUS_FAILED, TR_FMT1,
          "EHCI ERROR: imxrt_qtd_statusphase failed\n"),
  TRENTRY(EHCI_TRACE1_TRANSFER_FAILED, TR_FMT1,
          "EHCI ERROR: Transfer failed %d\n"),
  TRENTRY(EHCI_TRACE1_QHFOREACH_FAILED, TR_FMT1,
          "EHCI ERROR: imxrt_qh_foreach failed: %d\n"),
  TRENTRY(EHCI_TRACE1_SYSERR_INTR, TR_FMT1,
          "EHCI: Host System Error Interrupt\n"),
  TRENTRY(EHCI_TRACE1_USBERR_INTR, TR_FMT1,
          "EHCI: USB Error Interrupt (USBERRINT) Interrupt: %06x\n"),
  TRENTRY(EHCI_TRACE1_EPALLOC_FAILED, TR_FMT1,
          "EHCI ERROR: Failed to allocate EP info structure\n"),
  TRENTRY(EHCI_TRACE1_BADXFRTYPE, TR_FMT1,
          "EHCI ERROR: Support for transfer type %d not implemented\n"),
  TRENTRY(EHCI_TRACE1_HCHALTED_TIMEOUT, TR_FMT1,
          "EHCI ERROR: Timed out waiting for HCHalted. USBSTS: %06x\n"),
  TRENTRY(EHCI_TRACE1_QHPOOLALLOC_FAILED, TR_FMT1,
          "EHCI ERROR: Failed to allocate the QH pool\n"),

  TRENTRY(EHCI_TRACE1_QTDPOOLALLOC_FAILED, TR_FMT1,
          "EHCI ERROR: Failed to allocate the qTD pool\n"),
  TRENTRY(EHCI_TRACE1_PERFLALLOC_FAILED, TR_FMT1,
          "EHCI ERROR: Failed to allocate the periodic frame list\n"),
  TRENTRY(EHCI_TRACE1_RESET_FAILED, TR_FMT1,
          "EHCI ERROR: imxrt_reset failed: %d\n"),
  TRENTRY(EHCI_TRACE1_RUN_FAILED, TR_FMT1,
          "EHCI ERROR: EHCI Failed to run: USBSTS=%06x\n"),
  TRENTRY(EHCI_TRACE1_IRQATTACH_FAILED, TR_FMT1,
          "EHCI ERROR: Failed to attach IRQ%d\n"),

