apache/nuttx/arch/arm/src/imxrt/imxrt_ehci.c
  /* Is this the same value that we read from/wrote to the same register last
   * time?  Are we polling the register?  If so, suppress the output.
   */

  if (regaddr == prevaddr && regval == preval && prevwrite == iswrite)
    {
      /* Yes.. Just increment the count */

      count++;
    }
  else
    {
      /* No this is a new address or value or operation. Were there any
       * duplicate accesses before this one?
       */

      if (count > 0)
        {
          /* Yes.. Just one? */

          if (count == 1)
            {
              /* Yes.. Just one */

              imxrt_printreg(prevaddr, preval, prevwrite);
            }
          else
            {
              /* No.. More than one. */

              uinfo("[repeats %d more times]\n", count);
            }
        }

      /* Save the new address, value, count, and operation for next time */

      prevaddr  = (uint32_t *)regaddr;
      preval    = regval;
      count     = 0;
      prevwrite = iswrite;

      /* Show the new register access */

      imxrt_printreg(regaddr, regval, iswrite);
    }
}
#endif

/****************************************************************************
 * Name: imxrt_getreg
 *
 * Description:
 *   Get the contents of an IMXRT register
 *
 ****************************************************************************/

#ifdef CONFIG_IMXRT_EHCI_USB1_REGDEBUG
static uint32_t imxrt_getreg(volatile uint32_t *regaddr)
{
  /* Read the value from the register */

  uint32_t regval = *regaddr;

  /* Check if we need to print this value */

  imxrt_checkreg(regaddr, regval, false);
  return regval;
}
#else
static inline uint32_t imxrt_getreg(volatile uint32_t *regaddr)
{
  return *regaddr;
}
#endif

/****************************************************************************
 * Name: imxrt_putreg
 *
 * Description:
 *   Set the contents of an IMXRT register to a value
 *
 ****************************************************************************/

#ifdef CONFIG_IMXRT_EHCI_USB1_REGDEBUG
static void imxrt_putreg(uint32_t regval, volatile uint32_t *regaddr)
{
  /* Check if we need to print this value */

  imxrt_checkreg(regaddr, regval, true);

  /* Write the value */

  *regaddr = regval;
}
#else
static inline void imxrt_putreg(uint32_t regval, volatile uint32_t *regaddr)
{
  *regaddr = regval;
}
#endif

/****************************************************************************
 * Name: ehci_wait_usbsts
 *
 * Description:
 *   Wait for either (1) a field in the USBSTS register to take a specific
 *   value, (2) for a timeout to occur, or (3) a error to occur.  Return
 *   a value to indicate which terminated the wait.
 *
 ****************************************************************************/

static int ehci_wait_usbsts(int controller, uint32_t maskbits,
                            uint32_t donebits, unsigned int delay)
{
  uint32_t regval;
  unsigned int timeout;

  timeout = 0;
  do
    {
      /* Wait 5usec before trying again */

      up_udelay(5);
      timeout += 5;

      /* Read the USBSTS register and check for a system error */

      regval = imxrt_getreg(&HCOR(controller)->usbsts);
      if ((regval & EHCI_INT_SYSERROR) != 0)
        {
          usbhost_trace1(EHCI_TRACE1_SYSTEMERROR, regval);
          return -EIO;
        }

      /* Mask out the bits of interest */

      regval &= maskbits;

      /* Loop until the masked bits take the specified value or until a
       * timeout occurs.
       */
    }
  while (regval != donebits && timeout < delay);

  /* We got here because either the waited for condition or a timeout
   * occurred.  Return a value to indicate which.
   */

  return (regval == donebits) ? OK : -ETIMEDOUT;
}

/****************************************************************************
 * Name: imxrt_qh_alloc
 *
 * Description:
 *   Allocate a Queue Head (QH) structure by removing it from the free list
 *
 * Assumption:  Caller holds the lock
 *
 ****************************************************************************/

static struct imxrt_qh_s *imxrt_qh_alloc(struct imxrt_ehci_dev_s *ehci_dev)
{
  struct imxrt_qh_s *qh;

  /* Remove the QH structure from the freelist */

  qh = (struct imxrt_qh_s *)ehci_dev->ehci->qhfree;
  if (qh)
    {
      ehci_dev->ehci->qhfree = ((struct imxrt_list_s *)qh)->flink;
      memset(qh, 0, sizeof(struct imxrt_qh_s));
    }

  return qh;
}

/****************************************************************************
 * Name: imxrt_qh_free
 *
 * Description:
 *   Free a Queue Head (QH) structure by returning it to the free list
 *
 * Assumption:  Caller holds the lock
 *
 ****************************************************************************/

static void imxrt_qh_free(struct imxrt_qh_s *qh,
                          struct imxrt_ehci_dev_s *ehci_dev)
{
  struct imxrt_list_s *entry = (struct imxrt_list_s *)qh;

  /* Put the QH structure back into the free list */

  entry->flink  = ehci_dev->ehci->qhfree;
  ehci_dev->ehci->qhfree = entry;
}

/****************************************************************************
 * Name: imxrt_qtd_alloc
 *
 * Description:
 *   Allocate a Queue Element Transfer Descriptor (qTD) by removing it from
 *   the free list
 *
 * Assumption:  Caller holds the lock
 *
 ****************************************************************************/

static struct imxrt_qtd_s *imxrt_qtd_alloc(struct imxrt_ehci_dev_s *ehci_dev)
{
  struct imxrt_qtd_s *qtd;

  /* Remove the qTD from the freelist */

  qtd = (struct imxrt_qtd_s *)ehci_dev->ehci->qtdfree;
  if (qtd)
    {
      ehci_dev->ehci->qtdfree = ((struct imxrt_list_s *)qtd)->flink;
      memset(qtd, 0, sizeof(struct imxrt_qtd_s));
    }

  return qtd;
}

/****************************************************************************
 * Name: imxrt_qtd_free
 *
 * Description:
 *   Free a Queue Element Transfer Descriptor (qTD) by returning it to the
 *   free list
 *
 * Assumption:
 *   Caller holds the lock
 *
 ****************************************************************************/

static void imxrt_qtd_free(struct imxrt_qtd_s *qtd,
                           struct imxrt_ehci_dev_s *ehci_dev)
{
  struct imxrt_list_s *entry = (struct imxrt_list_s *)qtd;

  /* Put the qTD back into the free list */

  entry->flink   = ehci_dev->ehci->qtdfree;
  ehci_dev->ehci->qtdfree = entry;
}

/****************************************************************************
 * Name: imxrt_qh_foreach
 *
 * Description:
 *   Give the first entry in a list of Queue Head (QH) structures, call the
 *   handler for each QH structure in the list (including the one at the head
 *   of the list).
 *
 ****************************************************************************/

static int imxrt_qh_foreach(struct imxrt_qh_s *qh, uint32_t **bp,
                            foreach_qh_t handler, void *arg,
                            struct imxrt_ehci_dev_s *ehci_dev)
{
  struct imxrt_qh_s *next;
  uintptr_t physaddr;
  int ret;

  DEBUGASSERT(qh && handler);
  while (qh)
    {
      /* Is this the end of the list?  Check the horizontal link pointer
       * (HLP) terminate (T) bit.  If T==1, then the HLP address is not
       * valid.
       */

      physaddr = imxrt_swap32(qh->hw.hlp);
      if ((physaddr & QH_HLP_T) != 0)
        {
          /* Set the next pointer to NULL.  This will terminate the loop. */

          next = NULL;
        }

