apache/nuttx/arch/arm/src/imxrt/imxrt_ehci.c
      regval = imxrt_getreg(&HCOR(ctrid)->usbcmd);
    }
  while (((regval & EHCI_USBCMD_HCRESET) != 0) && (timeout < 1000000));

  /* Return either success or a timeout */

  return (regval & EHCI_USBCMD_HCRESET) != 0 ? -ETIMEDOUT : OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: imxrt_ehci_initialize
 *
 * Description:
 *   Initialize USB EHCI host controller hardware.
 *
 * Input Parameters:
 *   controller -- If the device supports more than one EHCI interface, then
 *     this identifies which controller is being initialized.  Normally, this
 *     is just zero.
 *
 * Returned Value:
 *   And instance of the USB host interface.  The controlling task should
 *   use this interface to (1) call the wait() method to wait for a device
 *   to be connected, and (2) call the enumerate() method to bind the device
 *   to a class driver.
 *
 * Assumptions:
 * - This function should called in the initialization sequence in order
 *   to initialize the USB device functionality.
 * - Class drivers should be initialized prior to calling this function.
 *   Otherwise, there is a race condition if the device is already connected.
 *
 ****************************************************************************/

struct usbhost_connection_s *imxrt_ehci_initialize(int controller)
{
  struct usbhost_hubport_s    *hport;
  struct imxrt_ehci_s         *ehci;
  struct imxrt_qh_s           *asynchead;
  struct imxrt_qh_s           *qhpool;
  struct imxrt_qtd_s          *qtdpool;
  struct imxrt_qh_s           *intrhead;
  struct imxrt_ehci_dev_s     *ehci_dev;
  struct imxrt_usbhost_conn_s *usb_conn;
  uint32_t *framelist;
  uint32_t regval;
#  if defined(CONFIG_DEBUG_USB) && defined(CONFIG_DEBUG_INFO)
  uint16_t regval16;
  unsigned int nports;
#  endif
  uintptr_t physaddr;
  int ret;
  int end;
  int i;

  /* Sanity checks */

  DEBUGASSERT(controller == 0 || controller == 1);
  DEBUGASSERT(((uintptr_t)&g_asynchead_usb1 & 0x1f) == 0);
  DEBUGASSERT((sizeof(struct imxrt_qh_s) & 0x1f) == 0);
  DEBUGASSERT((sizeof(struct imxrt_qtd_s) & 0x1f) == 0);

#  ifdef CONFIG_IMXRT_EHCI_USB1_PREALLOCATE
  DEBUGASSERT(((uintptr_t)&g_qhpool_usb1 & 0x1f) == 0);
  DEBUGASSERT(((uintptr_t)&g_qtdpool_usb1 & 0x1f) == 0);
#  endif

#  ifndef CONFIG_USBHOST_INT_DISABLE
  DEBUGASSERT(((uintptr_t)&g_intrhead_usb1 & 0x1f) == 0);
#    ifdef CONFIG_IMXRT_EHCI_PREALLOCATE
  DEBUGASSERT(((uintptr_t)g_framelist_usb1 & 0xfff) == 0);
#    endif
#  endif /* CONFIG_USBHOST_INT_DISABLE */

#if defined(CONFIG_IMXRT_USBOTG1)
  if (controller == 0)
    {
      ehci      = &g_ehci_usb1;
      asynchead = &g_asynchead_usb1;
      qhpool    = &g_qhpool_usb1[0];
      qtdpool   = &g_qtdpool_usb1[0];
      framelist = &g_framelist_usb1[0];
      intrhead  = &g_intrhead_usb1;
      ehci_dev  = &g_ehci_dev_usb1;
      usb_conn  = &g_ehci_usb1_conn;
    }
#endif

#if defined(CONFIG_IMXRT_USBOTG2)
  if (controller == 1)
    {
      ehci      = &g_ehci_usb2;
      asynchead = &g_asynchead_usb2;
      qhpool    = &g_qhpool_usb2[0];
      qtdpool   = &g_qtdpool_usb2[0];
      framelist = &g_framelist_usb2[0];
      intrhead  = &g_intrhead_usb2;
      ehci_dev  = &g_ehci_dev_usb2;
      usb_conn  = &g_ehci_usb2_conn;
    }
#endif

  /* Software Configuration *************************************************/

  usbhost_vtrace1(EHCI_VTRACE1_INITIALIZING, 0);

  /* Initialize function address generation logic */

  usbhost_devaddr_initialize(&ehci->devgen);

  /* Initialize the root hub port structures */

  for (i = 0; i < IMXRT_EHCI_NRHPORT; i++)
    {
      struct imxrt_rhport_s *rhport = &ehci->rhport[i];

      /* Initialize the device operations */

      rhport->drvr.ep0configure = imxrt_ep0configure;
      rhport->drvr.epalloc = imxrt_epalloc;
      rhport->drvr.epfree = imxrt_epfree;
      rhport->drvr.alloc = imxrt_alloc;
      rhport->drvr.free = imxrt_free;
      rhport->drvr.ioalloc = imxrt_ioalloc;
      rhport->drvr.iofree = imxrt_iofree;
      rhport->drvr.ctrlin = imxrt_ctrlin;
      rhport->drvr.ctrlout = imxrt_ctrlout;
      rhport->drvr.transfer = imxrt_transfer;
#  ifdef CONFIG_USBHOST_ASYNCH
      rhport->drvr.asynch = imxrt_asynch;
#  endif
      rhport->drvr.cancel = imxrt_cancel;
#  ifdef CONFIG_USBHOST_HUB
      rhport->drvr.connect = imxrt_connect;
#  endif
      rhport->drvr.disconnect = imxrt_disconnect;
      rhport->hport.pdevgen   = &ehci->devgen;

      /* Let's to identify the controller */

      rhport->ehci_dev = ehci_dev;
      rhport->ehci_dev->ctrid = controller;

      /* Initialize EP0 */

      rhport->ep0.xfrtype = USB_EP_ATTR_XFER_CONTROL;
      rhport->ep0.speed = USB_SPEED_FULL;
      rhport->ep0.maxpacket = 8;
      nxsem_init(&rhport->ep0.iocsem, 0, 0);

      /* Initialize the public port representation */

      hport = &rhport->hport.hport;
      hport->drvr = &rhport->drvr;
#  ifdef CONFIG_USBHOST_HUB
      hport->parent = NULL;
#  endif
      hport->ep0 = &rhport->ep0;
      hport->port = i;
      hport->speed = USB_SPEED_FULL;
    }

#  if defined(CONFIG_IMXRT_USBOTG1) \
   && !defined(CONFIG_IMXRT_EHCI_USB1_PREALLOCATE)
  /* Allocate a pool of free Queue Head (QH) structures */

  g_qhpool_usb1 = kmm_memalign(32, CONFIG_IMXRT_EHCI_USB1_NQHS *
                               sizeof(struct imxrt_qh_s));
  if (!g_qhpool_usb1)
    {
      usbhost_trace1(EHCI_TRACE1_QHPOOLALLOC_FAILED, 0);
      return NULL;
    }
#  endif

#  if defined(CONFIG_IMXRT_USBOTG2) \
   && !defined(CONFIG_IMXRT_EHCI_USB2_PREALLOCATE)
  /* Allocate a pool of free Queue Head (QH) structures */

  g_qhpool_usb2 = kmm_memalign(32, CONFIG_IMXRT_EHCI_USB2_NQHS *
                               sizeof(struct imxrt_qh_s));
  if (!g_qhpool_usb2)
    {
      usbhost_trace1(EHCI_TRACE1_QHPOOLALLOC_FAILED, 0);
      return NULL;
    }
#  endif

  /* Initialize the list of free Queue Head (QH) structures */

