apache/nuttx/arch/arm/src/imxrt/imxrt_ehci.c
#  if defined(CONFIG_IMXRT_USBOTG1)
  if (controller == 0)
    {
      end = CONFIG_IMXRT_EHCI_USB1_NQHS;
    }
#endif

#  if defined(CONFIG_IMXRT_USBOTG2)
  if (controller == 1)
    {
      end = CONFIG_IMXRT_EHCI_USB2_NQHS;
    }
#endif

  for (i = 0; i < end; i++)
    {
      /* Put the QH structure in a free list */

      imxrt_qh_free(&qhpool[i], ehci_dev);
    }

#  if defined(CONFIG_IMXRT_USBOTG1) \
   && !defined(CONFIG_IMXRT_EHCI_USB1_PREALLOCATE)
  /* Allocate a pool of free Transfer Descriptor (qTD) structures */

  g_qtdpool_usb1 = kmm_memalign(32, CONFIG_IMXRT_EHCI_USB1_NQTDS *
                               sizeof(struct imxrt_qtd_s));
  if (!g_qtdpool_usb1)
    {
      usbhost_trace1(EHCI_TRACE1_QTDPOOLALLOC_FAILED, 0);
      kmm_free(g_qhpool_usb1);
      return NULL;
    }
#  endif

#  if defined(CONFIG_IMXRT_USBOTG2) \
   && !defined(CONFIG_IMXRT_EHCI_USB2_PREALLOCATE)
  /* Allocate a pool of free Transfer Descriptor (qTD) structures */

  g_qtdpool_usb2 = kmm_memalign(32, CONFIG_IMXRT_EHCI_USB2_NQTDS *
                               sizeof(struct imxrt_qtd_s));
  if (!g_qtdpool_usb2)
    {
      usbhost_trace1(EHCI_TRACE1_QTDPOOLALLOC_FAILED, 0);
      kmm_free(g_qhpool_usb2);
      return NULL;
    }
#  endif

#  if defined(CONFIG_IMXRT_USBOTG1) && \
     !defined(CONFIG_IMXRT_EHCI_USB1_PREALLOCATE) && \
     !defined(CONFIG_USBHOST_INT_DISABLE)
  /* Allocate the periodic framelist */

  g_framelist_usb1 = kmm_memalign(4096, FRAME_LIST_SIZE * sizeof(uint32_t));
  if (!g_framelist_usb1)
    {
      usbhost_trace1(EHCI_TRACE1_PERFLALLOC_FAILED, 0);
      kmm_free(g_qhpool_usb1);
      kmm_free(g_qtdpool_usb1);
      return NULL;
    }
#  endif

#  if defined(CONFIG_IMXRT_USBOTG2) && \
     !defined(CONFIG_IMXRT_EHCI_USB2_PREALLOCATE) && \
     !defined(CONFIG_USBHOST_INT_DISABLE)
  /* Allocate the periodic framelist */

  g_framelist_usb2 = kmm_memalign(4096, FRAME_LIST_SIZE * sizeof(uint32_t));
  if (!g_framelist_usb2)
    {
      usbhost_trace1(EHCI_TRACE1_PERFLALLOC_FAILED, 0);
      kmm_free(g_qhpool_usb2);
      kmm_free(g_qtdpool_usb2);
      return NULL;
    }
#  endif

#  if defined(CONFIG_IMXRT_USBOTG1)
  if (controller == 0)
    {
      end = CONFIG_IMXRT_EHCI_USB1_NQTDS;
    }
#endif

#  if defined(CONFIG_IMXRT_USBOTG2)
  if (controller == 1)
    {
      end = CONFIG_IMXRT_EHCI_USB2_NQTDS;
    }
#endif

  /* Initialize the list of free Transfer Descriptor (qTD) structures */

  for (i = 0; i < end; i++)
    {
      /* Put the TD in a free list */

      imxrt_qtd_free(&qtdpool[i], ehci_dev);
    }

  /* EHCI Hardware Configuration ********************************************/

  imxrt_clockall_usboh3();

  /* Reset the controller from the OTG peripheral */

  putreg32(USBDEV_USBCMD_RST, IMXRT_USBDEV_USBCMD(controller));
  while ((getreg32(IMXRT_USBDEV_USBCMD(controller)) &
          USBDEV_USBCMD_RST) != 0);

  /* Program the controller to be the USB host controller Fixed selections:
   * CM = Host mode ES = 0, Little endian mode.  SLOM Not used in host mode.
   * VBPS = 1, off-chip power source Configurable selections: SDIS = 1,
   * Stream disable mode.  Eliminates overruns/underruns at the expense of
   * some performance.
   */

#  if defined(CONFIG_IMXRT_EHCI_USB1_SDIS) || defined(CONFIG_IMXRT_EHCI_USB2_SDIS)
  putreg32(USBHOST_USBMODE_CM_HOST | USBHOST_USBMODE_SDIS |
           USBHOST_USBMODE_VBPS, IMXRT_USBDEV_USBMODE(controller));
#  else
  putreg32(USBHOST_USBMODE_CM_HOST | USBHOST_USBMODE_VBPS,
           IMXRT_USBDEV_USBMODE(controller));
#  endif

  /* Reset the EHCI hardware */

  ret = imxrt_reset(controller);
  if (ret < 0)
    {
      usbhost_trace1(EHCI_TRACE1_RESET_FAILED, -ret);
      return NULL;
    }

  /* Re-program the USB host controller.  As implemented, imxrt_reset()
   * requires the host mode setup in order to work.  However, we lose the
   * host configuration in the reset.
   */

#  if defined(CONFIG_IMXRT_EHCI_USB1_SDIS) || defined(CONFIG_IMXRT_EHCI_USB2_SDIS)
  putreg32(USBHOST_USBMODE_CM_HOST | USBHOST_USBMODE_SDIS |
           USBHOST_USBMODE_VBPS, IMXRT_USBDEV_USBMODE(controller));
#  else
  putreg32(USBHOST_USBMODE_CM_HOST | USBHOST_USBMODE_VBPS,
           IMXRT_USBDEV_USBMODE(controller));
#  endif

  /* Disable all interrupts */

  imxrt_putreg(0, &HCOR(controller)->usbintr);

  /* Clear pending interrupts.  Bits in the USBSTS register are cleared by
   * writing a '1' to the corresponding bit.
   */

  imxrt_putreg(EHCI_INT_ALLINTS, &HCOR(controller)->usbsts);

#  if defined(CONFIG_DEBUG_USB) && defined(CONFIG_DEBUG_INFO)
  /* Show the EHCI version */

  regval16 = imxrt_swap16(HCCR(controller)->hciversion);
  usbhost_vtrace2(EHCI_VTRACE2_HCIVERSION, regval16 >> 8, regval16 & 0xff);

  /* Verify that the correct number of ports is reported */

  regval = imxrt_getreg(&HCCR(controller)->hcsparams);
  nports = (regval & EHCI_HCSPARAMS_NPORTS_MASK) >>
            EHCI_HCSPARAMS_NPORTS_SHIFT;

  usbhost_vtrace2(EHCI_VTRACE2_HCSPARAMS, nports, regval);
  DEBUGASSERT(nports == IMXRT_EHCI_NRHPORT);

  /* Show the HCCPARAMS register */

  regval = imxrt_getreg(&HCCR(controller)->hccparams);
  usbhost_vtrace1(EHCI_VTRACE1_HCCPARAMS, regval);
#  endif

  /* Initialize the head of the asynchronous queue/reclamation list. "In
   * order to communicate with devices via the asynchronous schedule, system
   * software must write the ASYNDLISTADDR register with the address of a
   * control or bulk queue head. Software must then enable the asynchronous
   * schedule by writing a one to the Asynchronous Schedule Enable bit in
   * the USBCMD register. In order to communicate with devices via the
   * periodic schedule, system software must enable the periodic schedule by
   * writing a one to the Periodic Schedule Enable bit in the USBCMD
   * register. Note that the schedules can be turned on before the first
   * port is reset (and enabled)."
   */

  memset(asynchead, 0, sizeof(struct imxrt_qh_s));
  physaddr = imxrt_physramaddr((uintptr_t)asynchead);
  asynchead->hw.hlp = imxrt_swap32(physaddr | QH_HLP_TYP_QH);
  asynchead->hw.epchar = imxrt_swap32(QH_EPCHAR_H | QH_EPCHAR_EPS_FULL);
  asynchead->hw.overlay.nqp = imxrt_swap32(QH_NQP_T);
  asynchead->hw.overlay.alt = imxrt_swap32(QH_NQP_T);
  asynchead->hw.overlay.token = imxrt_swap32(QH_TOKEN_HALTED);
  asynchead->fqp = imxrt_swap32(QTD_NQP_T);

  /* Set the Current Asynchronous List Address. */

  up_flush_dcache((uintptr_t)&asynchead->hw,
    (uintptr_t)&asynchead->hw + sizeof(struct ehci_qh_s));

  imxrt_putreg(imxrt_swap32(physaddr), &HCOR(controller)->asynclistaddr);

#  ifndef CONFIG_USBHOST_INT_DISABLE

  /* Initialize the head of the periodic list.  Since Isochronous endpoints
   * are not not yet supported, each element of the frame list is initialized
   * to point to the Interrupt Queue Head (g_intrhead).
   */

