apache/nuttx/arch/arm/src/imxrt/imxrt_ehci.c
  memset(intrhead, 0, sizeof(struct imxrt_qh_s));
  intrhead->hw.hlp = imxrt_swap32(QH_HLP_T);
  intrhead->hw.overlay.nqp = imxrt_swap32(QH_NQP_T);
  intrhead->hw.overlay.alt = imxrt_swap32(QH_NQP_T);
  intrhead->hw.overlay.token = imxrt_swap32(QH_TOKEN_HALTED);
  intrhead->hw.epcaps = imxrt_swap32(QH_EPCAPS_SSMASK(1));

  /* Attach the periodic QH to Period Frame List */

  physaddr = imxrt_physramaddr((uintptr_t)intrhead);
  for (i = 0; i < FRAME_LIST_SIZE; i++)
    {
      framelist[i] = imxrt_swap32(physaddr) | PFL_TYP_QH;
    }

  /* Set the Periodic Frame List Base Address. */

  physaddr = imxrt_physramaddr((uintptr_t) framelist);
  imxrt_putreg(imxrt_swap32(physaddr), &HCOR(controller)->periodiclistbase);
#  endif

  /* Enable the asynchronous schedule and, possibly enable the periodic
   * schedule and set the frame list size.
   */

  regval = imxrt_getreg(&HCOR(controller)->usbcmd);
  regval &= ~(EHCI_USBCMD_HCRESET | EHCI_USBCMD_FLSIZE_MASK |
              EHCI_USBCMD_FLSIZE_MASK | EHCI_USBCMD_PSEN |
              EHCI_USBCMD_IAADB | EHCI_USBCMD_LRESET);
  regval |= EHCI_USBCMD_ASEN;

#  ifndef CONFIG_USBHOST_INT_DISABLE
  regval |= EHCI_USBCMD_PSEN;
#    if FRAME_LIST_SIZE == 1024
  regval |= EHCI_USBCMD_FLSIZE_1024;
#    elif FRAME_LIST_SIZE == 512
  regval |= EHCI_USBCMD_FLSIZE_512;
#    elif FRAME_LIST_SIZE == 512
  regval |= EHCI_USBCMD_FLSIZE_256;
#    else
#      error Unsupported frame size list size
#    endif
#  endif

  imxrt_putreg(regval, &HCOR(controller)->usbcmd);

  /* Start the host controller by setting the RUN bit in the USBCMD
   * register.
   */

  regval = imxrt_getreg(&HCOR(controller)->usbcmd);
  regval |= EHCI_USBCMD_RUN;
  imxrt_putreg(regval, &HCOR(controller)->usbcmd);

  /* Route all ports to this host controller by setting the CONFIG flag. */

  regval = imxrt_getreg(&HCOR(controller)->configflag);
  regval |= EHCI_CONFIGFLAG;
  imxrt_putreg(regval, &HCOR(controller)->configflag);

  /* Wait for the EHCI to run (i.e., no longer report halted) */

  ret = ehci_wait_usbsts(controller, EHCI_USBSTS_HALTED, 0, 100 * 1000);
  if (ret < 0)
    {
      usbhost_trace1(EHCI_TRACE1_RUN_FAILED,
                     imxrt_getreg(&HCOR(controller)->usbsts));
      return NULL;
    }

  /* Interrupt Configuration ************************************************/

#ifdef CONFIG_IMXRT_USBOTG1
  if (controller == 0)
    {
      ret = irq_attach(IMXRT_IRQ_USBOTG1, imxrt_ehci_interrupt,
                       (void *) ehci_dev);
      if (ret != 0)
        {
          usbhost_trace1(EHCI_TRACE1_IRQATTACH_FAILED, IMXRT_IRQ_USBOTG1);
          return NULL;
        }
    }
#endif

#ifdef CONFIG_IMXRT_USBOTG2
  if (controller == 1)
    {
      ret = irq_attach(IMXRT_IRQ_USBOTG1, imxrt_ehci_interrupt,
                       (void *) ehci_dev);
      if (ret != 0)
        {
          usbhost_trace1(EHCI_TRACE1_IRQATTACH_FAILED, IMXRT_IRQ_USBOTG2);
          return NULL;
        }
    }
#endif

  /* Enable EHCI interrupts.  Interrupts are still disabled at the level of
   * the interrupt controller.
   */

  imxrt_putreg(EHCI_HANDLED_INTS, &HCOR(controller)->usbintr);

  /* Enable interrupts at the interrupt controller */

  up_enable_irq(IMXRT_IRQ_USBOTG1);

  /* Drive Vbus +5V (the smoke test) */

  for (i = 0; i < IMXRT_EHCI_NRHPORT; i++)
    {
      /* Enable VBUS power for the port */

      imxrt_usbhost_vbusdrive(controller, i, true);
      up_mdelay(25);
    }

  /* If there is a USB device in the slot at power up, then we will not get
   * the status change interrupt to signal us that the device is connected.
   * We need to set the initial connected state accordingly.
   */

  for (i = 0; i < IMXRT_EHCI_NRHPORT; i++)
    {
      ehci->rhport[i].connected =
        ((imxrt_getreg(&HCOR(controller)->portsc[i]) &
         EHCI_PORTSC_CCS) != 0);
    }

  usbhost_vtrace1(EHCI_VTRACE1_INIITIALIZED, 0);

  return (struct usbhost_connection_s *) usb_conn;
}

/****************************************************************************
 * Name: usbhost_trformat1 and usbhost_trformat2
 *
 * Description:
 *   This interface must be provided by platform specific logic that knows
 *   the HCDs encoding of USB trace data.
 *
 *   Given an 9-bit index, return a format string suitable for use with, say,
 *   printf.  The returned format is expected to handle two unsigned integer
 *   values.
 *
 ****************************************************************************/

#ifdef HAVE_USBHOST_TRACE
const char *usbhost_trformat1(uint16_t id)
{
  int ndx = TRACE1_INDEX(id);

  if (ndx < TRACE1_NSTRINGS)
    {
      return g_trace1[ndx].string;
    }

  return NULL;
}

const char *usbhost_trformat2(uint16_t id)
{
  int ndx = TRACE2_INDEX(id);

  if (ndx < TRACE2_NSTRINGS)
    {
      return g_trace2[ndx].string;
    }

  return NULL;
}
#endif /* HAVE_USBHOST_TRACE */

#endif /* CONFIG_IMXRT_USBOTG && CONFIG_USBHOST */
